package com.company.day023;

public class Oop {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}
	
	/*
	 1. 자바 저장 단위
	 	변수 < 배열 < 배열(속성) + 메서드 (기능)
	 										= 클래스(부품객체)
	 	-클래스는 속성과 기능으로 이루어져 있다.
	 										
	 2. OOP (Object Oriented Programming)
	    :  객체 지향 프로그래밍 ( 부품 객체를 조립해 완성된 프로그램을 만드는 기법 )
	    
	 3. 객체들의 관계 --> UML 업그레이드
	   1) 집합관계 - 예) 자동차 클래스 - 바퀴 클래스 + 엔진 클래스...   										
	   2) 상속관계 - 상속을 통해 재활용, 예) 모바일5 --> 모바일4
	   3) 사용관계 - 운전자 클래스 -> 자동차클래스 사용
	   
	   
	 4. 클래스와 객체, 인스턴스
	   1) 클래스 - 설계도 - 예) 붕어빵 기계
	   2)  객체 - 실제 메모리 공간 빌려서 반들어진 객체  --> 붕어빵 기계를 이용해서 빵굽기 (인스턴스화)  
	   3) 인스턴스 - 각각 세부(팥 붕어빵, 슈크림 붕어빵, 초코 붕어빵)
	   
	   
	 5. 객체 생성 및 사용    

*/
}
